code-review/NRB_3471_3546/База_Было/DataProcessors/ФормированиеУслугДепозитария.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеУслугДепозитария</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодОтбора</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПоОснованиямУслуг</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроекОтчета</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УслугиПоПоручениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугиДепозитария</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УслугиДепозитария</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСделки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгодоприобретатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРасчетаКомиссии</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеНеСоответствуютДокументу</Name>
							<Comment>Расчетные данные не соответствуют существующему документу УслугиДепозитария</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УслугиПоФормамW8</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугиДепозитария</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УслугиДепозитария</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСделки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгодоприобретатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФормыW8</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРасчетаКомиссии</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеНеСоответствуютДокументу</Name>
							<Comment>Расчетные данные не соответствуют существующему документу УслугиДепозитария</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляФормирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
								<v8:Type>cfg:CatalogRef.ФормыW8</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДокументовНаОсновании</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СообщениеОбОшибке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокУслуги</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПорученияОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдСтрокиУслуг</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперацииД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
								<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инициатор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыПоручений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыW8Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдСтрокиУслуг</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФормыW8</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредоставления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипФормы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыФормW8</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ПравилаФормированияУслугДепозитария.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПравилаФормированияУслугДепозитария</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагАктивности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ФормированиеУслугДепозитария/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Заполняет первоначальные параметры обработки
//
Процедура ИнициироватьПараметры() Экспорт
	
	ПрошлыйМесяц = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПрошлыйМесяц);
	ПериодОтбора.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПериодОтбора.ДатаНачала = ПрошлыйМесяц.ДатаНачала;
	ПериодОтбора.ДатаОкончания = ПрошлыйМесяц.ДатаОкончания;
	ПериодРасчета = КонецМесяца(ПрошлыйМесяц.ДатаОкончания);
	ДатаДокумента = ТекущаяДатаСеанса();
	РежимОтчета = Ложь;
	
КонецПроцедуры

// Подготавливает данные для создания документов УслугиДепозитария по реквизитам обработки и помещает их в табличные части
Процедура ЗаполнитьУслугиКНачислению() Экспорт
	
	УслугиПоПоручениям.Очистить();
	УслугиПоФормамW8.Очистить();
	ПорученияОснования.Очистить();
	ФормыW8Основания.Очистить();
	
	ЗаполнитьДанныеДляФормирования();
	
	Если ДанныеДляФормирования.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для формирования услуг");
	КонецЕсли;
	
	ЗапросДляСозданияУслуг = ЗапросДляСозданияУслуг();
	РезультатЗапроса = ЗапросДляСозданияУслуг.ВыполнитьПакет();
	ИндексЗапросаПоНеобработаннымДокументамСКонца = 2;
	НеобработанныеДокументы = РезультатЗапроса[РезультатЗапроса.ВГраница() - ИндексЗапросаПоНеобработаннымДокументамСКонца].Выбрать();
	ДокументыКФормированию = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока НеобработанныеДокументы.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Не удалось определить услугу для документа %1", НеобработанныеДокументы.ДокументПредставление));
	КонецЦикла;
	
	СформироватьУслугиПоВыборкеДанных(ДокументыКФормированию);
КонецПроцедуры

// Создает документы УслугиДепозитария на основании данных в табличных частях
Процедура СформироватьДокументы() Экспорт
	СформироватьДокументыПоУслугам(УслугиПоПоручениям, ПорученияОснования);
	СформироватьДокументыПоУслугам(УслугиПоФормамW8, ФормыW8Основания);
КонецПроцедуры

// Производит указанное действие с отмеченными в табличной части документами услуг
//
// Параметры:
//  ИмяТаблицы	 - Строка - Имя табличной части обработки
//  Действие	 - Строка - Провести, ПометитьНаУдаление, СнятьПометкуУдаления
//
Процедура ОбработатьУслуги(ИмяТаблицы, Действие) Экспорт
	
	ДанныеОДокументахКОбработке = ДанныеОбОтмеченныхДокументах(ИмяТаблицы);
		
	Для Каждого ДанныеОДокументе Из ДанныеОДокументахКОбработке Цикл
		ОбработатьДокумент(ДанныеОДокументе, Действие);
		ДанныеОДокументе = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

// Непосредственно удаляет отмеченные в табличной части документы услуг
//
// Параметры:
//  ИмяТаблицы	 - Строка - Имя табличной части обработки
//
Процедура УдалитьУслуги(ИмяТаблицы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеОДокументахКОбработке = ДанныеОбОтмеченныхДокументах(ИмяТаблицы);
	
	Для Каждого ДанныеОДокументе Из ДанныеОДокументахКОбработке Цикл
		ДокОбъект = ДанныеОДокументе.УслугиДепозитария.ПолучитьОбъект();
		Если Не ДокОбъект.Проведен Тогда
			ДокОбъект.Удалить();
			Для Каждого Строка Из ДанныеОДокументе.СтрокиCЭтимДокументом Цикл
				Строка.Отметка = Ложь;
				Строка.УслугиДепозитария = Неопределено;
			КонецЦикла;
		Иначе
			ТекстСообщения = СтрШаблон(
				"Документ %1 проведен, для удаления необходимо отменить проведение или пометить его на удаление",
				ДокОбъект.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		ДанныеОДокументе = Неопределено;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

// Устанавливает все отметки в табличной части
//
// Параметры:
//  ИмяТаблицы	 - Строка - Имя табличной части обработки
//
Процедура УстановитьОтметки(ИмяТаблицы) Экспорт
	Для Каждого Строка Из ЭтотОбъект[ИмяТаблицы] Цикл
		Строка.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры

// Убирает все отметки в табличной части
//
// Параметры:
//  ИмяТаблицы	 - Строка - Имя табличной части обработки
//
Процедура СнятьОтметки(ИмяТаблицы) Экспорт
	Для Каждого Строка Из ЭтотОбъект[ИмяТаблицы] Цикл
		Строка.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

// Формирует отчет по основаниям к формированию услуг
//
Процедура СформироватьОтчетПоОснованиям() Экспорт
	
	ОтчетПоОснованиямУслуг.Очистить();
	
	ЗаполнитьДанныеДляФормирования();
	
	ЗапросДляСозданияУслуг = ЗапросДляСозданияУслуг();
	РезультатЗапроса = ЗапросДляСозданияУслуг.ВыполнитьПакет();
	НеобработанныеДокументы = РезультатЗапроса[РезультатЗапроса.ВГраница() - 1].Выбрать();
	ДанныеОснованийУслуг = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДанныеОтчета = ДанныеДляФормирования.ВыгрузитьКолонки();
	ДанныеОтчета.Колонки.Добавить("НачислитьКомиссиюДепо");
	ДанныеОтчета.Колонки.Добавить("ВидОперации");
	ДанныеОтчета.Колонки.Добавить("ВалютаУслуги");
	ДанныеОтчета.Колонки.Добавить("Тариф");
	ДанныеОтчета.Колонки.Добавить("СуммаКомиссии");
	ДанныеОтчета.Колонки.Добавить("ТипТарифа");
	ДанныеОтчета.Колонки.Добавить("Выгодоприобретатель");
	ДанныеОтчета.Колонки.Добавить("УслугиДепозитария");
	
	Пока НеобработанныеДокументы.Следующий() Цикл
		СтрокаОтчета = ДанныеОтчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОтчета, НеобработанныеДокументы);
		СтрокаОтчета.СообщениеОбОшибке = "Не определена услуга для документа";
	КонецЦикла;
	
	Пока ДанныеОснованийУслуг.Следующий() Цикл
		СтрокаОтчета = ДанныеОтчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОтчета, ДанныеОснованийУслуг);
	КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ДанныеОснованийУслуг", ДанныеОтчета);
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	СхемаКомпоновкиДанных = Обработки.ФормированиеУслугДепозитария.ПолучитьМакет("МакетОснованияУслуг");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
		КомпоновщикНастроекОтчета.ПолучитьНастройки(),
		ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ОтчетПоОснованиямУслуг);
	
	ПроцессорВывода.НачатьВывод();
	ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	Пока ЭлементРезультата <> Неопределено Цикл
		Для Каждого ЗначениеПараметра Из ЭлементРезультата.ЗначенияПараметров Цикл
			Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
				ЗначениеПараметра.Значение = ДанныеРасшифровки.Элементы[ЗначениеПараметра.Значение].ПолучитьПоля()[0].Значение;
			КонецЕсли;
		КонецЦикла;
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеОбОтмеченныхДокументах(ИмяТаблицы)
	ДанныеОбОтмеченныхДокументах = Новый Массив;
	ДанныеОТекущемДокументе = Неопределено;
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект[ИмяТаблицы] Цикл
		Если Не СтрокаТЧ.Отметка Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.УслугиДепозитария) Тогда
			Если ДанныеОТекущемДокументе = Неопределено Или ДанныеОТекущемДокументе.УслугиДепозитария <> СтрокаТЧ.УслугиДепозитария Тогда
				ДанныеОТекущемДокументе = Новый Структура("УслугиДепозитария, СтрокиCЭтимДокументом", СтрокаТЧ.УслугиДепозитария, Новый Массив);
				ДанныеОбОтмеченныхДокументах.Добавить(ДанныеОТекущемДокументе);
			КонецЕсли;
			ДанныеОТекущемДокументе.СтрокиCЭтимДокументом.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеОбОтмеченныхДокументах;
КонецФункции

Процедура ОбработатьДокумент(ДанныеОДокументе, Действие)
	ДокОбъект = ДанныеОДокументе.УслугиДепозитария.ПолучитьОбъект();
	
	Если Действие = "Провести" Тогда
		
		Если ДокОбъект.ПометкаУдаления Тогда
			ДокОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	ИначеЕсли Действие = "ПометитьНаУдаление" Тогда
		
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		ДокОбъект.УстановитьПометкуУдаления(Истина);
		
	ИначеЕсли Действие = "СнятьПометкуУдаления" Тогда
		
		Если ДокОбъект.ПометкаУдаления Тогда
			ДокОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		
	ИначеЕсли Действие = "ОтменитьПроведение" Тогда
		
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияклиентСервер.СообщитьПользователю("Не предусмотренное обозначение действия: " + Действие);
		
	КонецЕсли;
	
	Для Каждого Строка Из ДанныеОДокументе.СтрокиCЭтимДокументом Цикл
		Строка.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьДанныеДляФормирования()
	
	ДанныеДляФормирования.Очистить();
	
	СхемаКомпоновки = РегистрыСведений.ПравилаФормированияУслугДепозитария.ПолучитьМакет("СхемаДляОтбораДокументов");
	АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновки, Новый УникальныйИдентификатор);
	ОчищатьТекущиеОтборы = Истина;
	
	ПравилаФормированияУслуг = РегистрыСведений.ПравилаФормированияУслугДепозитария.ДействующиеПравила(КонецМесяца(ПериодРасчета));
	
	Если Не ЗначениеЗаполнено(ПравилаФормированияУслуг) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Отсутствуют правила формирования услуг на дату %1", КонецМесяца(ПериодРасчета)));
		Возврат;
	КонецЕсли;
	
	Пока ПравилаФормированияУслуг.Следующий() Цикл
		
		ПравилоОтбораДокументов = ПравилаФормированияУслуг.Правило.Получить();
		
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновки);
		НастройкиСхемы = Новый КомпоновщикНастроекКомпоновкиДанных;
		НастройкиСхемы.Инициализировать(ИсточникНастроек);
		НастройкиСхемы.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(
			НастройкиСхемы.Настройки.Отбор,
			ПравилоОтбораДокументов.Отбор,
			ОчищатьТекущиеОтборы);
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиСхемы.ПолучитьНастройки());
		Запрос = Новый Запрос(МакетКомпоновки.НаборыДанных.ДокументыКНачислениюУслуг.Запрос);
		
		Для Каждого ОписаниеПараметра Из МакетКомпоновки.ЗначенияПараметров Цикл
			Запрос.УстановитьПараметр(ОписаниеПараметра.Имя, ОписаниеПараметра.Значение);
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ПериодСреза", ПериодОтбора.ДатаОкончания);
		Запрос.УстановитьПараметр("ОрганизацияПоУмолчанию", ОбщегоНазначенияПовтИсп.ОрганизацияПоУмолчанию());
		Запрос.УстановитьПараметр("МестоХраненияПоУмолчанию", ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("МестоХраненияПоУмолчанию"));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодОтбора.ДатаНачала);
		Запрос.УстановитьПараметр("ОкончаниеПериода", ПериодОтбора.ДатаОкончания);
		Запрос.УстановитьПараметр("ВыводитьВсеДокументы", РежимОтчета);
		ДанныеДокументовПоУслуге = Запрос.Выполнить().Выбрать();
		
		Пока ДанныеДокументовПоУслуге.Следующий() Цикл
			Если ЗначениеЗаполнено(Контрагент) И Контрагент <> ДанныеДокументовПоУслуге.Депонент Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ДанныеДляФормирования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДокументовПоУслуге);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПравилаФормированияУслуг, "Услуга, ПорядокУслуги");
			Если ЗначениеЗаполнено(ДанныеДокументовПоУслуге.СообщениеОбОшибке) Тогда
				ТекстСообщения = СтрШаблон("%1: документ %2",
					ДанныеДокументовПоУслуге.СообщениеОбОшибке,
					ДанныеДокументовПоУслуге.Документ);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	УдалитьИзВременногоХранилища(АдресСхемыКомпоновки);
	
КонецПроцедуры

Процедура СформироватьУслугиПоВыборкеДанных(ДокументыКФормированию)
	Пока ДокументыКФормированию.Следующий() Цикл
		Если ЗначениеЗаполнено(ДокументыКФормированию.УслугиДепозитария) Тогда
			СуществующийДокументУслугиДепозитария = ДокументыКФормированию.УслугиДепозитария.ПолучитьОбъект();
		Иначе
			СуществующийДокументУслугиДепозитария = Неопределено;
		КонецЕсли;
		
		ДанныеПоДепонентам = ДокументыКФормированию.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ДанныеПоДепонентам.Следующий() Цикл
			ПроверитьСрокДействияДоговора(ДанныеПоДепонентам);
			Выгодоприобретатели = ДанныеПоДепонентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выгодоприобретатели.Следующий() Цикл
				ДанныеПоУслугам = Выгодоприобретатели.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ДанныеПоУслугам.Следующий() Цикл
					СформироватьСтрокуУслугСАктуальнымиДанными(СуществующийДокументУслугиДепозитария, ДанныеПоДепонентам,
																Выгодоприобретатели, ДанныеПоУслугам);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьСтрокуУслугСАктуальнымиДанными(СуществующийДокументУслугиДепозитария, ДанныеПоДепонентам,
														Выгодоприобретатели, ДанныеПоУслугам)
	ДанныеОНовойСтрокеУслуг = НоваяСтрокаУслугПоВыборке(ДанныеПоУслугам);
	НоваяСтрокаУслуг = ДанныеОНовойСтрокеУслуг.НоваяСтрокаУслуг;
	НоваяСтрокаУслуг.Контрагент = ДанныеПоДепонентам.Депонент;
	НоваяСтрокаУслуг.Договор = ДанныеПоДепонентам.Договор;
	НоваяСтрокаУслуг.ПериодРасчетаКомиссии = ПериодРасчета;
	ЗаполнитьЗначенияСвойств(НоваяСтрокаУслуг, ДанныеПоУслугам);
	Если Выгодоприобретатели.ТребуетсяЗаполнениеВыгодоприобретателя Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Для услуги в строке %1 не удалось определить выгодоприобретателя", НоваяСтрокаУслуг.НомерСтроки));
	КонецЕсли;
	ДокументыОснования = ДанныеПоУслугам.Выбрать();
	ЗаполнитьОснованияУслуги(НоваяСтрокаУслуг, ДанныеОНовойСтрокеУслуг.ТЧОснования, ДокументыОснования);
	Если СуществующийДокументУслугиДепозитария <> Неопределено Тогда
		НоваяСтрокаУслуг.УслугиДепозитария = СуществующийДокументУслугиДепозитария.Ссылка;
		// Проверяется что в документе есть такая же строка как в расчетных данных. При этом если в документе есть "лишняя" строка - это
		// проверяться не будет, но предполагается что такой ситуации быть не должно исходя из анализа бизнес-процесса.
		Если Не РасчетныеДанныеСоответствуютДокументу(НоваяСтрокаУслуг, СуществующийДокументУслугиДепозитария) Тогда
			НоваяСтрокаУслуг.ДанныеНеСоответствуютДокументу = Истина;
			ТекстСообщения = СтрШаблон("В строке %1 расчетные данные не соответствуют существующему документу № %2",
					НоваяСтрокаУслуг.НомерСтроки, СуществующийДокументУслугиДепозитария.Номер);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция РасчетныеДанныеСоответствуютДокументу(НоваяСтрокаУслуг, СуществующийДокумент)
	ДанныеСоответствуют = Ложь;
	
	СписокРеквизитов = "Валюта, ВидОперации, МестоХранения, СуммаСделки, Тариф, ТипТарифа, Услуга, СуммаКомиссии, Выгодоприобретатель";
	ПараметрыОтбора = Новый Структура(СписокРеквизитов);
	ЗаполнитьЗначенияСвойств(ПараметрыОтбора, НоваяСтрокаУслуг);
	НайденныеСтроки = СуществующийДокумент.Услуги.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ДанныеСоответствуют = СуществующийДокумент.Контрагент = НоваяСтрокаУслуг.Контрагент
								И СуществующийДокумент.Договор = НоваяСтрокаУслуг.Договор
								И СуществующийДокумент.ПериодРасчетаКомиссии = НоваяСтрокаУслуг.ПериодРасчетаКомиссии;
	КонецЕсли;
	
	Возврат ДанныеСоответствуют;
КонецФункции

Процедура ПроверитьСрокДействияДоговора(ДанныеПоДепонентам)
	Если Не ЗначениеЗаполнено(ДанныеПоДепонентам.Договор) Тогда
		Возврат;
	КонецЕсли;
	Если ДанныеПоДепонентам.ДатаНачалаДействияДоговора > ДатаДокумента
			Или ЗначениеЗаполнено(ДанныеПоДепонентам.ДатаОкончанияДействияДоговора)
			И ДанныеПоДепонентам.ДатаОкончанияДействияДоговора <= ДатаДокумента Тогда
		Текст = СтрШаблон("По %1 депоненту истек срок действия договора %2", ДанныеПоДепонентам.Депонент, ДанныеПоДепонентам.Договор);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	КонецЕсли;
КонецПроцедуры

Функция НоваяСтрокаУслугПоВыборке(Выборка)
	НоваяСтрокаУслуг = Неопределено;
	ТЧОснования = Неопределено;
	
	Если Выборка.ЭтоУслугиПоПоручениям Тогда
		НоваяСтрокаУслуг = УслугиПоПоручениям.Добавить();
		ТЧОснования = ПорученияОснования;
	КонецЕсли;
	Если Выборка.ЭтоУслугиПоФормамW8 Тогда
		НоваяСтрокаУслуг = УслугиПоФормамW8.Добавить();
		ТЧОснования = ФормыW8Основания;
	КонецЕсли;
	
	Если НоваяСтрокаУслуг = Неопределено Тогда
		ВызватьИсключение("Не предусмотренный тип документа-основания для услуг: " + Строка(Выборка.Документ));
	КонецЕсли;
	
	НоваяСтрокаУслуг.ИдСтроки = Новый УникальныйИдентификатор();
	
	Результат = Новый Структура("НоваяСтрокаУслуг, ТЧОснования", НоваяСтрокаУслуг, ТЧОснования);
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьОснованияУслуги(СтрокаУслуг, ТЧОснования, ВыборкаОснования, ТекстовыйСписокОснований = Неопределено)
	Пока ВыборкаОснования.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаОснования.Документ) Тогда
			НовСтрокаСОснованиемУслуги = ТЧОснования.Добавить();
			НовСтрокаСОснованиемУслуги.ИдСтрокиУслуг = СтрокаУслуг.ИдСтроки;
			ЗаполнитьЗначенияСвойств(НовСтрокаСОснованиемУслуги, ВыборкаОснования);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьДокументыПоУслугам(ТЧУслуги, ТЧОснованияДляУслуг)
	СоздатьНовыеДокументы(ТЧУслуги, ТЧОснованияДляУслуг);
	ЗаполнитьЗановоДокументыКоторыеНеБылиПроведены(ТЧУслуги, ТЧОснованияДляУслуг);
КонецПроцедуры

Процедура ЗаполнитьЗановоДокументыКоторыеНеБылиПроведены(ТЧУслуги, ТЧОснованияДляУслуг)
	ПомеченныеДокументы = ПомеченныеДокументы(ТЧУслуги);
	Для Каждого ДанныеОДокументе Из ПомеченныеДокументы Цикл
		Если ДанныеОДокументе.Проведен Тогда
			Текст = ДанныеОДокументе.ПредставлениеСсылки + " нельзя заполнить заново, так как этот документ проведен";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		ИначеЕсли ДанныеОДокументе.ПометкаУдаления Тогда
			Текст = ДанныеОДокументе.ПредставлениеСсылки + " нельзя заполнить заново, так как этот документ на удаление";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Иначе
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("УслугиДепозитария", ДанныеОДокументе.Ссылка);
			СтрокиТЧУслуги = ТЧУслуги.НайтиСтроки(ПараметрыОтбора);
			УслугиДепозитария = ДанныеОДокументе.Ссылка.ПолучитьОбъект();
			УслугиДепозитария.Услуги.Очистить();
			ЗаполнитьИПровестиДокументУслуги(УслугиДепозитария, СтрокиТЧУслуги, ТЧОснованияДляУслуг);
			Текст = ДанныеОДокументе.ПредставлениеСсылки + " - выполнено заполнение заново и этот документ был проведен";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПомеченныеДокументы(ТЧУслуги)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка", Истина);
	СтрокиСОтметкой = ТЧУслуги.НайтиСтроки(ПараметрыОтбора); 
	ИмяКолонкиСДокументами = "УслугиДепозитария";
	ТЗДокументыСОтметкой = ТЧУслуги.Выгрузить(СтрокиСОтметкой, ИмяКолонкиСДокументами);
	ТЗДокументыСОтметкой.Свернуть(ИмяКолонкиСДокументами);
	ДокументыСОтметкой = ТЗДокументыСОтметкой.ВыгрузитьКолонку(ИмяКолонкиСДокументами);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументУслугиДепозитария.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДокументУслугиДепозитария.Ссылка) КАК ПредставлениеСсылки,
	|	ДокументУслугиДепозитария.Проведен КАК Проведен,
	|	ДокументУслугиДепозитария.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.УслугиДепозитария КАК ДокументУслугиДепозитария
	|ГДЕ
	|	ДокументУслугиДепозитария.Ссылка В(&ДокументыСОтметкой)";
	Запрос.УстановитьПараметр("ДокументыСОтметкой", ДокументыСОтметкой);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура СоздатьНовыеДокументы(ТЧУслуги, ТЧОснованияДляУслуг)
	СтрокиДляОдногоДокумента = Новый Массив;
	ТекКонтрагент = Неопределено;
	ТекДоговор = Неопределено;
	
	Для Каждого Строка Из ТЧУслуги Цикл
		Если Строка.Отметка И Не ЗначениеЗаполнено(Строка.УслугиДепозитария) Тогда
			Если ТекКонтрагент <> Строка.Контрагент И ТекДоговор <> Строка.Договор Тогда
				Если СтрокиДляОдногоДокумента.Количество() > 0 Тогда
					СоздатьДокументУслуги(СтрокиДляОдногоДокумента, ТЧОснованияДляУслуг);
					СтрокиДляОдногоДокумента.Очистить();
				КонецЕсли;
				ТекКонтрагент = Строка.Контрагент;
				ТекДоговор = Строка.Договор;
			КонецЕсли;
			СтрокиДляОдногоДокумента.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	СоздатьДокументУслуги(СтрокиДляОдногоДокумента, ТЧОснованияДляУслуг);
КонецПроцедуры

Процедура СоздатьДокументУслуги(СтрокиТЧУслуги, ТЧОснованияДляУслуг)
	Если СтрокиТЧУслуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПерваяСтрока = СтрокиТЧУслуги[0];
	Если Не ЗначениеЗаполнено(ПерваяСтрока.Контрагент) Тогда
		Текст = СтрШаблон("Не удалось создать документ ""Услуги депозитария"" по строке N %1 таблицы %2, так как не указан контрагент",
							ПерваяСтрока.НомерСтроки, ИмяТЧУслуг(ТЧОснованияДляУслуг));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПерваяСтрока.Договор) Тогда
			Текст = СтрШаблон("Не удалось создать документ ""Услуги депозитария"" по строке N %1 таблицы %2, так как не указан договор",
							ПерваяСтрока.НомерСтроки, ИмяТЧУслуг(ТЧОснованияДляУслуг));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	УслугиДепозитария = Документы.УслугиДепозитария.СоздатьДокумент();
	ЗаполнитьИПровестиДокументУслуги(УслугиДепозитария, СтрокиТЧУслуги, ТЧОснованияДляУслуг);
КонецПроцедуры

Функция ИмяТЧУслуг(ТЧОснованияДляУслуг)
	Если ТЧОснованияДляУслуг = ПорученияОснования Тогда
		ИмяТЧУслуги = "Услуги по поручениям";
	Иначе
		ИмяТЧУслуги = "Услуги по формам W8";
	КонецЕсли;
	
	Возврат ИмяТЧУслуги;
КонецФункции

Процедура ЗаполнитьИПровестиДокументУслуги(УслугиДепозитария, СтрокиТЧУслуги, ТЧОснованияДляУслуг)
	ОснованияДляСоздаваемогоДокумента = Новый ТаблицаЗначений;
	ОснованияДляСоздаваемогоДокумента.Колонки.Добавить("Основание");
	
	ПерваяСтрока = СтрокиТЧУслуги[0];
	УслугиДепозитария.Дата = ДатаДокумента;
	УслугиДепозитария.ПериодРасчетаКомиссии = ПериодРасчета;
	УслугиДепозитария.Контрагент = ПерваяСтрока.Контрагент;
	УслугиДепозитария.Договор = ПерваяСтрока.Договор;
	ЗаполнитьСтрокиДокумента(УслугиДепозитария, СтрокиТЧУслуги, ТЧОснованияДляУслуг,  ОснованияДляСоздаваемогоДокумента);
	
	НачатьТранзакцию();
	Попытка
		Если Не ЗначениеЗаполнено(УслугиДепозитария.Ссылка) Тогда
			УслугиДепозитария.Комментарий = "Создано автоматически";
			// Проводить сразу нельзя, т.к. при проведении РС ОснованияУслугДепозитария уже должен быть заполнен
			// чтобы сработало удаление связанных поручения из РС ДокументыКНачислениюКомиссииДепо (отображается
			// как галочка "Начислить комисиию депо" в поручениях).
			УслугиДепозитария.Записать(РежимЗаписиДокумента.Запись);
		Иначе
			УслугиДепозитария.Комментарий = "Заполнено заново автоматически";
		КонецЕсли;
		ЗаполнитьЗаписиРегистраОснованияУслугДепозитария(УслугиДепозитария, ОснованияДляСоздаваемогоДокумента);
		УслугиДепозитария.Записать(РежимЗаписиДокумента.Проведение);
		Для Каждого СтрокаТЧ Из СтрокиТЧУслуги Цикл
			СтрокаТЧ.УслугиДепозитария = УслугиДепозитария.Ссылка;
			СтрокаТЧ.Отметка = Ложь;
			СтрокаТЧ.ДанныеНеСоответствуютДокументу = Ложь;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		МенеджерОшибок = Новый МенеджерОбработкиОшибок;
		ТекстСообщения = СтрШаблон(
			"Не удалось записать документ услуги депозитария. %1",
			МенеджерОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации("Формирование услуг депозитария", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиДокумента(УслугиДепозитария, СтрокиТЧУслуги, ТЧОснованияДляУслуг,  ОснованияДляСоздаваемогоДокумента)
	Для Каждого СтрокаТЧ Из СтрокиТЧУслуги Цикл
		СтрокаУслуги = УслугиДепозитария.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаУслуги, СтрокаТЧ);
		ПараметрыОтбора = Новый Структура("ИдСтрокиУслуг", СтрокаТЧ.ИдСтроки);
		ОснованияДляУслугИзЭтогоДокумента = ТЧОснованияДляУслуг.НайтиСтроки(ПараметрыОтбора);
		Для Каждого ДанныеОбОсновании Из ОснованияДляУслугИзЭтогоДокумента Цикл
			НовСтокаТЗ = ОснованияДляСоздаваемогоДокумента.Добавить();
			НовСтокаТЗ.Основание = ДанныеОбОсновании.Документ;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьЗаписиРегистраОснованияУслугДепозитария(УслугиДепозитария, ОснованияДляСоздаваемогоДокумента)
	Набор = РегистрыСведений.ОснованияУслугДепозитария.СоздатьНаборЗаписей();
	Набор.Отбор.УслугиДепозитария.Установить(УслугиДепозитария.Ссылка);
	ОснованияДляСоздаваемогоДокумента.Свернуть("Основание");
	ОснованияДляСоздаваемогоДокумента.Колонки.Добавить("УслугиДепозитария");
	ОснованияДляСоздаваемогоДокумента.ЗаполнитьЗначения(УслугиДепозитария.Ссылка, "УслугиДепозитария");
	Набор.Загрузить(ОснованияДляСоздаваемогоДокумента);
	Набор.Записать(Истина);
КонецПроцедуры

Функция ЗапросДляСозданияУслуг()
	
	ТекстЗапросаПолученияДанных =
	"ВЫБРАТЬ
	|	ДанныеДляФормирования.Документ КАК Документ,
	|	ДанныеДляФормирования.Депонент КАК Депонент,
	|	ДанныеДляФормирования.Договор КАК Договор,
	|	ДанныеДляФормирования.КоличествоДокументовНаОсновании КАК КоличествоДокументовНаОсновании,
	|	ДанныеДляФормирования.Услуга КАК Услуга,
	|	ДанныеДляФормирования.ПорядокУслуги КАК ПорядокУслуги,
	|	ДанныеДляФормирования.СообщениеОбОшибке КАК СообщениеОбОшибке
	|ПОМЕСТИТЬ ДанныеДляФормированияУслуг
	|ИЗ
	|	&ДанныеДляФормирования КАК ДанныеДляФормирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифыСрезПоследних.Услуга КАК Услуга,
	|	МАКСИМУМ(ТарифыСрезПоследних.Тариф) КАК Тариф,
	|	МАКСИМУМ(ТарифыСрезПоследних.ТипТарифа) КАК ТипТарифа
	|ПОМЕСТИТЬ Тарифы
	|ИЗ
	|	РегистрСведений.Тарифы.СрезПоследних(&ДатаТарифов, 1 = 1) КАК ТарифыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифыСрезПоследних.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредоставленныеДокументыСрезПоследних.ПредоставленнаяФорма КАК ФормаW8,
	|	МАКСИМУМ(ПредоставленныеДокументыСрезПоследних.Депонент) КАК Депонент
	|ПОМЕСТИТЬ ВТ_ДепонентыФормW8
	|ИЗ
	|	РегистрСведений.ПредоставленныеДокументы.СрезПоследних(
	|			,
	|			ПредоставленнаяФорма В
	|				(ВЫБРАТЬ
	|					ДокументыКНачислениюКомиссииДепо.Документ КАК Форма
	|				ИЗ
	|					РегистрСведений.ДокументыКНачислениюКомиссииДепо КАК ДокументыКНачислениюКомиссииДепо
	|				ГДЕ
	|					ДокументыКНачислениюКомиссииДепо.Документ ССЫЛКА Справочник.ФормыW8)) КАК ПредоставленныеДокументыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредоставленныеДокументыСрезПоследних.ПредоставленнаяФорма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поручение.Ссылка КАК Документ,
	|	ИСТИНА КАК НачислитьКомиссиюДепо,
	|	Поручение.ВидОперацииД КАК ВидОперации,
	|	ПРЕДСТАВЛЕНИЕ(Поручение.Ссылка) КАК ДокументПредставление
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыКНачислениюКомиссииДепо КАК ДокументыКНачислениюКомиссииДепо
	|		ПО Поручение.Ссылка = ДокументыКНачислениюКомиссииДепо.Документ
	|ГДЕ
	|	ДокументыКНачислениюКомиссииДепо.Документ ЕСТЬ НЕ NULL 
	|	И Поручение.ДатаИсполненияПоручения МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И Поручение.Проведен
	|	И НЕ Поручение.Ссылка В
	|				(ВЫБРАТЬ
	|					ДанныеДляФормированияУслуг.Документ КАК Документ
	|				ИЗ
	|					ДанныеДляФормированияУслуг КАК ДанныеДляФормированияУслуг)
	|	И ВЫБОР
	|			КОГДА &Депонент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			КОГДА Поручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ОтменаПоручения)
	|				ТОГДА ВЫРАЗИТЬ(Поручение.ОтменяемоеПоручение КАК Документ.Поручение).Депонент = &Депонент
	|			КОГДА Поручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|					И Поручение.Инициатор = Поручение.Контрагент
	|				ТОГДА Поручение.Инициатор = &Депонент
	|			ИНАЧЕ Поручение.Депонент = &Депонент
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФормыW8.Ссылка,
	|	ИСТИНА,
	|	NULL,
	|	ПРЕДСТАВЛЕНИЕ(ФормыW8.Ссылка)
	|ИЗ
	|	Справочник.ФормыW8 КАК ФормыW8
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыКНачислениюКомиссииДепо КАК ДокументыКНачислениюКомиссииДепо
	|		ПО ФормыW8.Ссылка = ДокументыКНачислениюКомиссииДепо.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДепонентыФормW8 КАК ВТ_ДепонентыФормW8
	|		ПО (ВТ_ДепонентыФормW8.ФормаW8 = ФормыW8.Ссылка)
	|ГДЕ
	|	ДокументыКНачислениюКомиссииДепо.Документ ЕСТЬ НЕ NULL 
	|	И ФормыW8.ДатаПредоставления МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И НЕ ФормыW8.ПометкаУдаления
	|	И НЕ ФормыW8.Ссылка В
	|				(ВЫБРАТЬ
	|					ДанныеДляФормированияУслуг.Документ КАК Документ
	|				ИЗ
	|					ДанныеДляФормированияУслуг КАК ДанныеДляФормированияУслуг)
	|	И ВЫБОР
	|			КОГДА &Депонент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВТ_ДепонентыФормW8.Депонент = &Депонент
	|		КОНЕЦ";
	
	Если РежимОтчета Тогда
		ТекстЗапросаИтоговаяВыборка =
		"ВЫБРАТЬ
		|	ДанныеДляФормированияУслуг.Документ КАК Документ,
		|	ВЫБОР
		|		КОГДА ДокументыКНачислениюКомиссииДепо.Документ ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК НачислитьКомиссиюДепо,
		|	ВЫБОР
		|		КОГДА ДанныеДляФормированияУслуг.Документ ССЫЛКА Документ.Поручение
		|			ТОГДА ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Документ КАК Документ.Поручение).ВидОперацииД
		|	КОНЕЦ КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА ДанныеДляФормированияУслуг.Депонент ССЫЛКА Справочник.Субклиенты
		|			ТОГДА ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Депонент КАК Справочник.Субклиенты).Владелец
		|		ИНАЧЕ ДанныеДляФормированияУслуг.Депонент
		|	КОНЕЦ КАК Депонент,
		|	ДанныеДляФормированияУслуг.Договор КАК Договор,
		|	ДанныеДляФормированияУслуг.Услуга КАК Услуга,
		|	ДанныеДляФормированияУслуг.Услуга.Валюта КАК ВалютаУслуги,
		|	ДанныеДляФормированияУслуг.ПорядокУслуги КАК ПорядокУслуги,
		|	ДанныеДляФормированияУслуг.СообщениеОбОшибке КАК СообщениеОбОшибке,
		|	ЕСТЬNULL(Тарифы.Тариф, 0) КАК Тариф,
		|	ДанныеДляФормированияУслуг.КоличествоДокументовНаОсновании КАК КоличествоДокументовНаОсновании,
		|	ДанныеДляФормированияУслуг.КоличествоДокументовНаОсновании * ЕСТЬNULL(Тарифы.Тариф, 0) КАК СуммаКомиссии,
		|	Тарифы.ТипТарифа КАК ТипТарифа,
		|	ВЫБОР
		|		КОГДА ДанныеДляФормированияУслуг.Документ ССЫЛКА Справочник.ФормыW8
		|				И ДанныеДляФормированияУслуг.Депонент ССЫЛКА Справочник.Субклиенты
		|			ТОГДА ДанныеДляФормированияУслуг.Депонент
		|		КОГДА ДанныеДляФормированияУслуг.Документ ССЫЛКА Документ.Поручение
		|				И ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Документ КАК Документ.Поручение).ВидОперацииД В (&ВидыОперацииВыгодоприобретатели)
		|			ТОГДА ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Документ КАК Документ.Поручение).РазделСчетаДепо.Субклиент
		|	КОНЕЦ КАК Выгодоприобретатель,
		|	ОснованияУслугДепозитария.УслугиДепозитария КАК УслугиДепозитария
		|ИЗ
		|	ДанныеДляФормированияУслуг КАК ДанныеДляФормированияУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыКНачислениюКомиссииДепо КАК ДокументыКНачислениюКомиссииДепо
		|		ПО ДанныеДляФормированияУслуг.Документ = ДокументыКНачислениюКомиссииДепо.Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Тарифы КАК Тарифы
		|		ПО ДанныеДляФормированияУслуг.Услуга = Тарифы.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияУслугДепозитария КАК ОснованияУслугДепозитария
		|		ПО ДанныеДляФормированияУслуг.Документ = ОснованияУслугДепозитария.Основание
		|			И (НЕ ОснованияУслугДепозитария.УслугиДепозитария.ПометкаУдаления)";
	Иначе
		ТекстЗапросаИтоговаяВыборка =
		"ВЫБРАТЬ
		|	СтатусыПорученийСрезПоследних.Поручение КАК Поручение,
		|	СтатусыПорученийСрезПоследних.СтатусПоручения КАК СтатусПоручения
		|ПОМЕСТИТЬ ВТ_СтатусыОснований
		|ИЗ
		|	РегистрСведений.СтатусыПоручений.СрезПоследних(
		|			,
		|			Поручение В
		|				(ВЫБРАТЬ
		|					ДанныеДляФормированияУслуг.Документ КАК Документ
		|				ИЗ
		|					ДанныеДляФормированияУслуг КАК ДанныеДляФормированияУслуг)) КАК СтатусыПорученийСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДляФормированияУслуг.Документ КАК Документ,
		|	ПРЕДСТАВЛЕНИЕ(ДанныеДляФормированияУслуг.Документ) КАК ДокументПредставление,
		|	ВЫБОР
		|		КОГДА ДанныеДляФормированияУслуг.Депонент ССЫЛКА Справочник.Субклиенты
		|			ТОГДА ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Депонент КАК Справочник.Субклиенты).Владелец
		|		ИНАЧЕ ДанныеДляФормированияУслуг.Депонент
		|	КОНЕЦ КАК Депонент,
		|	ДанныеДляФормированияУслуг.Договор КАК Договор,
		|	ДанныеДляФормированияУслуг.Договор.ДатаНачалоДействия КАК ДатаНачалаДействияДоговора,
		|	ДанныеДляФормированияУслуг.Договор.ДатаОкончанияДействия КАК ДатаОкончанияДействияДоговора,
		|	ДанныеДляФормированияУслуг.Услуга КАК Услуга,
		|	ДанныеДляФормированияУслуг.Услуга.Валюта КАК Валюта,
		|	ДанныеДляФормированияУслуг.ПорядокУслуги КАК ПорядокУслуги,
		|	ЕСТЬNULL(Тарифы.Тариф, 0) КАК Тариф,
		|	ДанныеДляФормированияУслуг.КоличествоДокументовНаОсновании * ЕСТЬNULL(Тарифы.Тариф, 0) КАК СуммаКомиссии,
		|	Тарифы.ТипТарифа КАК ТипТарифа,
		|	ВЫБОР
		|		КОГДА ДанныеДляФормированияУслуг.Документ ССЫЛКА Справочник.ФормыW8
		|				И ДанныеДляФормированияУслуг.Депонент ССЫЛКА Справочник.Субклиенты
		|			ТОГДА ДанныеДляФормированияУслуг.Депонент
		|		КОГДА ДанныеДляФормированияУслуг.Документ ССЫЛКА Документ.Поручение
		|				И ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Документ КАК Документ.Поручение).ВидОперацииД В (&ВидыОперацииВыгодоприобретатели)
		|			ТОГДА ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Документ КАК Документ.Поручение).РазделСчетаДепо.Субклиент
		|	КОНЕЦ КАК Выгодоприобретатель,
		|	ВЫБОР
		|		КОГДА ДанныеДляФормированияУслуг.Документ ССЫЛКА Документ.Поручение
		|				И (ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Документ КАК Документ.Поручение).ВидОперацииД = &УчастиеВКД
		|						И ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Документ КАК Документ.Поручение).СчетДепо.ТипСчетаДепо В (&ТипыСчетовДЕПОВыгодоприобретатели)
		|					ИЛИ ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Документ КАК Документ.Поручение).ВидОперацииД = &ОтменаПоручения
		|						И ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Документ КАК Документ.Поручение).ОтменяемоеПоручение.СчетДепо.ТипСчетаДепо В (&ТипыСчетовДЕПОВыгодоприобретатели))
		|			ТОГДА ВЫРАЗИТЬ(ДанныеДляФормированияУслуг.Документ КАК Документ.Поручение).РазделСчетаДепо.Субклиент
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяЗаполнениеВыгодоприобретателя,
		|	ВЫБОР
		|		КОГДА ДанныеДляФормированияУслуг.Документ ССЫЛКА Документ.Поручение
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоУслугиПоПоручениям,
		|	ВЫБОР
		|		КОГДА ДанныеДляФормированияУслуг.Документ ССЫЛКА Справочник.ФормыW8
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоУслугиПоФормамW8,
		|	ЕСТЬNULL(ОснованияУслугДепозитария.УслугиДепозитария, ЗНАЧЕНИЕ(Документ.УслугиДепозитария.ПустаяСсылка)) КАК УслугиДепозитария,
		|	ДокументПоручение.ВидОперацииД КАК ВидОперацииД,
		|	ДокументПоручение.ВидКД КАК ВидКД,
		|	ДокументПоручение.Инициатор КАК Инициатор,
		|	ДокументПоручение.ДатаИсполненияПоручения КАК ДатаИсполнения,
		|	ВТ_СтатусыОснований.СтатусПоручения КАК Статус,
		|	ФормыW8.ТипФормы КАК ТипФормы,
		|	ФормыW8.ДатаПредоставления КАК ДатаПредоставления,
		|	ФормыW8.Код КАК Номер,
		|	ФормыW8.Наименование КАК Наименование
		|ИЗ
		|	ДанныеДляФормированияУслуг КАК ДанныеДляФормированияУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Тарифы КАК Тарифы
		|		ПО ДанныеДляФормированияУслуг.Услуга = Тарифы.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияУслугДепозитария КАК ОснованияУслугДепозитария
		|		ПО ДанныеДляФормированияУслуг.Документ = ОснованияУслугДепозитария.Основание
		|			И (НЕ ОснованияУслугДепозитария.УслугиДепозитария.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК ДокументПоручение
		|		ПО (ДанныеДляФормированияУслуг.Документ = ДокументПоручение.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыОснований КАК ВТ_СтатусыОснований
		|		ПО (ДанныеДляФормированияУслуг.Документ = ВТ_СтатусыОснований.Поручение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормыW8 КАК ФормыW8
		|		ПО (ДанныеДляФормированияУслуг.Документ = ФормыW8.Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокУслуги
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Документ),
		|	МАКСИМУМ(Договор),
		|	МАКСИМУМ(ДатаНачалаДействияДоговора),
		|	МАКСИМУМ(ДатаОкончанияДействияДоговора),
		|	МАКСИМУМ(Валюта),
		|	МАКСИМУМ(ПорядокУслуги),
		|	МАКСИМУМ(Тариф),
		|	СУММА(СуммаКомиссии),
		|	МАКСИМУМ(ТипТарифа),
		|	МАКСИМУМ(ТребуетсяЗаполнениеВыгодоприобретателя),
		|	МАКСИМУМ(ЭтоУслугиПоПоручениям),
		|	МАКСИМУМ(ЭтоУслугиПоФормамW8)
		|ПО
		|	УслугиДепозитария,
		|	Депонент,
		|	Выгодоприобретатель,
		|	Услуга";
	КонецЕсли;
	
	Разделитель = ";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПолученияДанных + Разделитель + ТекстЗапросаИтоговаяВыборка;
	
	Запрос.УстановитьПараметр("НачалоПериода",						ПериодОтбора.ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода",					ПериодОтбора.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаТарифов",						КонецМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ДанныеДляФормирования",				ДанныеДляФормирования.Выгрузить());
	Запрос.УстановитьПараметр("УчастиеВКД",							Справочники.ВидыОпераций.УчастиеВКД);
	Запрос.УстановитьПараметр("ОтменаПоручения",					Справочники.ВидыОпераций.ОтменаПоручения);
	Запрос.УстановитьПараметр("ВидыОперацииВыгодоприобретатели",	ВидыОперацииДляОпределенияВыгодоприобретателей());
	Запрос.УстановитьПараметр("ТипыСчетовДЕПОВыгодоприобретатели",	ТипыСчетовДЕПОДляОпределенияВыгодоприобретателей());
	Запрос.УстановитьПараметр("Депонент",							Контрагент);
		
	Возврат Запрос;
	
КонецФункции

Функция ВидыОперацииДляОпределенияВыгодоприобретателей()
	
	ВидыОпераций = Новый Массив;
	
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.Блокирование);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.Депонирование);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.Перевод);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.ПередачаВЗалог);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.Перемещение);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.СнятиеОбременения);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.Разблокирование);
	ВидыОпераций.Добавить(Справочники.ВидыОпераций.СнятиеСДепонирования);
	
	Возврат ВидыОпераций;
	
КонецФункции

Функция ТипыСчетовДЕПОДляОпределенияВыгодоприобретателей()
	
	ТипыСчетовДЕПО = Новый Массив;
	
	ТипыСчетовДЕПО.Добавить(Перечисления.ТипыСчетовДепо.ИностранногоНоминальногоДержателя);
	ТипыСчетовДЕПО.Добавить(Перечисления.ТипыСчетовДепо.ИностранногоНоминальногоДержателяТорговый);
	ТипыСчетовДЕПО.Добавить(Перечисления.ТипыСчетовДепо.НоминальногоДержателя);
	ТипыСчетовДЕПО.Добавить(Перечисления.ТипыСчетовДепо.НоминальногоДержателяТорговый);
	
	Возврат ТипыСчетовДЕПО;
	
КонецФункции

#КонецОбласти

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
